MrT203/STM32LAB1/STM32SOURCE/LAB1_Exercise/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RED1_Pin GPIO_PIN_4
#define RED1_GPIO_Port GPIOA
#define YELLOW1_Pin GPIO_PIN_5
#define YELLOW1_GPIO_Port GPIOA
#define GREEN1_Pin GPIO_PIN_6
#define GREEN1_GPIO_Port GPIOA
#define RED2_Pin GPIO_PIN_7
#define RED2_GPIO_Port GPIOA
#define YELLOW2_Pin GPIO_PIN_8
#define YELLOW2_GPIO_Port GPIOA
#define GREEN2_Pin GPIO_PIN_9
#define GREEN2_GPIO_Port GPIOA
#define RED3_Pin GPIO_PIN_10
#define RED3_GPIO_Port GPIOA
#define YELLOW3_Pin GPIO_PIN_11
#define YELLOW3_GPIO_Port GPIOA
#define GREEN3_Pin GPIO_PIN_12
#define GREEN3_GPIO_Port GPIOA
#define RED4_Pin GPIO_PIN_13
#define RED4_GPIO_Port GPIOA
#define YELLOW4_Pin GPIO_PIN_14
#define YELLOW4_GPIO_Port GPIOA
#define GREEN4_Pin GPIO_PIN_15
#define GREEN4_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
